In [1]:
import os
import pandas as pd

In [29]:
BASE_DIR = 'data'

RATINGS_CSV = 'ratings.csv'
USERS_CSV = 'users.csv'
MOVIES_CSV = 'movies.csv'

In [20]:
ratings = pd.read_csv(os.path.join(BASE_DIR, RATINGS_CSV))

In [21]:
ratings.head()

   Unnamed: 0  userid  movieid  rating
0           0       1     1193       5
1           1       1      661       3
2           2       1      914       3
3           3       1     3408       4
4           4       1     2355       5

In [27]:
users = pd.read_csv(os.path.join(BASE_DIR, USERS_CSV))

In [28]:
users.head()

   Unnamed: 0  userid gender  age  occupation zipcode
0           0       1      F    1          10   48067
1           1       2      M   56          16   70072
2           2       3      M   25          15   55117
3           3       4      M   45           7   02460
4           4       5      M   25          20   55455

In [30]:
movies = pd.read_csv(os.path.join(BASE_DIR, MOVIES_CSV))

In [31]:
movies.head()

,Unnamed: 0,movieid,title,genre
0,0,1,Toy Story (1995),Animation|Children's|Comedy
1,1,2,Jumanji (1995),Adventure|Children's|Fantasy
2,2,3,Grumpier Old Men (1995),Comedy|Romance
3,3,4,Waiting to Exhale (1995),Comedy|Drama
4,4,5,Father of the Bride Part II (1995),Comedy